Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེའི་བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་གསུམ་བྱུང་སྟེ། དེ་དག་ཐམས་ཅད་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ། ཐེག་པ་དཔག་ཏུ་མེད་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ། ཐེག་པ་གྲངས་མེད་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ། ཐེག་པ་བསམ་གྱིས་མི་ཁྱབ་ཅིང་གཞལ་དུ་མེད་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དཔག་ཏུ་མེད་པར་སྨོན་ལམ་གྱིས་ཡང་དག་པར་རབ་ཏུ་གནས་པ་དེ་བཞིན་དུ་སྦྱར་ཏེསངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་བརྗོད་དུ་མེད་པའི་བར་ལ་སྨོན་ལམ་གྱིས་ཡང་དག་པར་རབ་ཏུ་གནས་པ་རྣམས་སོ། །
en: He also had three assemblies of bodhisattvas, all of whom were fully immersed in the Great Vehicle, immersed in countless vehicles, fully immersed in innumerable vehicles, fully immersed in inconceivably, unfathomably many vehicles, fully immersed through their aspirations in countless pure buddha realms, . . . and fully immersed through their aspirations in inexpressibly many pure buddha realms.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུར་གནས་སོ། །
en: His sacred Dharma of nirvāṇa remained for eight hundred million years.

source: དེའི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གསེར་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །དེའི་རིན་པོ་ཆེ་སྣ་བདུན་བྱུང་བ་ནི་འདི་དག་ཡིན་ཏེ། འདི་ལྟ་སྟེ་འཁོར་ལོ་རིན་པོ་ཆེ་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། བློན་པོ་རིན་པོ་ཆེའི་བར་བདུན་པོ་དེ་དག་ཡིན་ནོ། །
en: During those days, a universal monarch bearing the seven treasures named Golden Banner appeared (the seven treasures being the precious wheel, and so on, up to the precious minister).

source: དེའི་བུ་སྟོང་ཐམ་པ་ཡོད་དེ་དཔའ་ཞིང་རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ།
en: He had one thousand sons, all of whom were brave, intrepid, and athletic, and who conquered all opposing forces.

source: དེ་ཐམས་ཅད་སའི་དཀྱིལ་འཁོར་འདི་འབའ་ཞིག་ཁོ་ནས་ཆད་པ་མེད་ཅིང་། མཚོན་གྱིས་བདའ་བ་མེད་ལ་རང་གི་ཆོས་ཀྱིས་ཤིན་ཏུ་གནས་སོ། །
en: Throughout the entire realm there was no punishment and no threat of weapons. Instead, everyone lived according to the law.

source: རྒྱལ་པོ་གསེར་གྱི་རྒྱལ་མཚན་གྱི་ཡུལ་རྣམ་པར་རྒྱལ་བྱེད་དེར། སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: Everyone in King Golden Banner’s kingdom, which was called Victorious , was practicing the path of the ten virtues.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དམྱལ་བ་དག་མ་བྱུང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དག་མ་བྱུང་། ལྷ་མ་ཡིན་གྱི་རིས་དག་མ་བྱུང་ངོ་། །
en: In the buddha realm in that era there were no hell beings, no animals, no inhabitants of the realms of the Lord of Death, and no demigods.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་དང་ལྡན་པར་གྱུར་ཅིང་། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ཚེ་ངེས་པར་གྱུར་ཏེསེམས་ཅན་རྣམས་ཀྱི་ཚེའི་ཚད་ལོ་སྟོང་ཕྲག་བརྒྱད་ཅུར་གྱུར་ཏོ། །
en: All the beings in the buddha realm at that time were engaged in the path of the ten virtues and their life span was fixed at eighty thousand years.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་གཏོང་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “At the same time there was a bodhisattva named Stainless Giver.

source: དེ་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བརྒྱད་ཅུ་དག་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །
en: He was carrying out the trainings of a bodhisattva along with a group of eighty thousand other bodhisattvas.

source: དེ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་རིང་བསྲེལ་ལ་མཆོད་པ་བྱ་བར་སྤྲོ་བར་གྱུར་ཏེ།
en: He delighted in venerating the relics of the Thus-Gone One, who had passed into parinirvāṇa.

source: དེ་བཞིན་གཤེགས་པ་དེའི་རིང་བསྲེལ་ལ་མཆོད་པ་བྱེད་པ་ནི་ལོ་ལྔར་བྱས་ཤིང་ཡོངས་སུ་བཟུང་ངོ་། །
en: He venerated the Thus-Gone One’s relics for five years.

source: དེར་ལོ་ལྔར་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དགུ་བཅུ་འདུས་ཏེ། དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་གཏོང་།
en: During those five years, nine hundred million bodhisattvas assembled and the bodhisattva Stainless Giver told them,

source: བདག་གི་དངོས་པོ་ཐམས་ཅད་གཏོང་བར་བྱེད་དེ།
en: ‘I will now give away all my possessions.

source: ཚེ་དང་ལྡན་པ་དག་གང་ལ་ཡོ་བྱད་གང་དགོས་པ་དེ་བདག་ཉིད་ཀྱིས་གཏང་བར་བགྱིའོ། །
en: Venerable ones, whatever you may need, I will give you that.

source: ཇི་ཙམ་དུ་ཤ་དང་ཁྲག་དགོས་ན་ཡང་གཏོང་ན་ཡོ་བྱད་གཞན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: I will even give you my flesh and blood if needed—so no need to mention my other possessions.’

source: དེའི་ཚེ་རྒྱལ་པོ་དྲི་མེད་ཟླ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་མངོན་པར་དད་ནས།
en: “At that time there was a king named Stainless Moon who had great faith in that bodhisattva.

source: དེས་འཁོར་གྱི་བཙུན་མོ་སྟོང་ཕྲག་བརྒྱད་ཅུ་དང་། བདག་ཉིད་ཀྱང་དགེ་འདུན་ལ་ཕུལ་བར་གྱུར་ཏོ། །
en: He said, ‘I will offer my entire retinue of eighty thousand queens and even myself to the saṅgha.

source: དེས་དགེ་སློང་རེ་རེ་དག་ལ་བདག་གི་བཙུན་མོ་དེ་དག་སླར་བླུ་བའི་ཕྱིར་ཆོས་གོས་དང་ལྷམ་ཟུང་དང་། གདུགས་དང་། རིལ་བ་སྤྱི་བླུགས་ཚོས་པ་དང་། ལུས་ལ་བགོ་བ་དང་། སྟེང་ནས་དགབ་པ་དང་། གདིང་བ་དང་། ལོངས་སྤྱོད་ཐམས་ཅད་ཕུལ་ལོ། །
en: Then to ransom my queens back, I will offer to each monk dharma robes, a set of sandals, an umbrella, a water jug, clothing for their bodies, protective overhangings, mats, and all other necessities.

source: དགེ་སློང་གི་དགེ་འདུན་ལ་ཇི་སྲིད་འཚོའི་བར་དུ་ཆོས་གོས་དང་བསོད་སྙོམས་དང་། མལ་ཆ་དང་ན་བའི་གསོས་སྨན་གྱི་རྐྱེན་གྱི་ཡོ་བྱད་རྣམས་མངོན་པར་སྦྱར་ཏོ། །
en: As long as the monastic saṅgha survives, I will provide them with conducive articles such as dharma robes, alms, bedding, and medicine.’

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་གཏོང་ཞེས་བྱ་བ་གང་གིས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་བསྟན་པ་ཡོངས་སུ་བཟུང་ཞིང་ལོ་ལྔར་བྱས་པར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva Stainless Giver—who, after the Thus-Gone One had passed into parinirvāṇa, upheld his teachings and carried out the quinquennial festival—was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་གཏོང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva known as Stainless Giver.

source: ངས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་བསྟན་པ་ཡོངས་སུ་བཟུང་ཞིང་དེ་ཡང་ལོ་ལྔར་བྱས་སོ། །
en: After the Thus-Gone One had passed into parinirvāṇa, I upheld his teachings and carried out the quinquennial festival.

source: དགེ་སློང་གི་དགེ་འདུན་དེ་དག་གི་བདེ་བའི་རིམ་གྲོ་བྱས་ཤིང་། ང་རྟག་ཏུ་སེམས་ཤིན་ཏུ་མཉམ་པར་བཞག་པར་གྱུར་ཏོ། །
en: I was the joyful servant of the monastic saṅgha, and always kept my mind in equilibrium.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་སྙོམས་པར་འཇུག་པ་འགོག་པ་མངོན་དུ་བྱ་བར་ཡོངས་སུ་བསྔོས་སོ། །
en: I dedicated all those roots of virtue, moreover, to manifesting the cessation of equilibrium.

source: དགེ་བའི་རྩ་བ་དེས་ངས་སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་དུ་བྱས་སོ། །
en: Due to those roots of virtue, I did actualize knowledge of cessation as related to knowledge of equilibrium.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙོམས་པར་འཇུག་པར་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་དུ་བྱ་བར་འདོད་པས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བར་སྤྲོ་བར་བྱ།
en: Therefore, Maudgalyāyana, bodhisattvas who want to actualize knowledge of cessation as related to knowledge of equilibrium should delight in venerating the Thus-Gone One.

source: དགེ་སློང་གི་དགེ་འདུན་ལ་ཡང་རིམ་གྲོ་ཡོངས་སུ་སྤྱད་པའི་ཕྱིར་སེམས་སྦྱང་བར་བྱའོ། །
en: They should also train their minds to carry out service toward the saṅgha.

source: མཽད་གལ་གྱི་བུ་ངས་སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཐོབ་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created unfathomably numerous roots of virtue in order to understand the path that leads to cessation as related to knowledge of equilibrium. I did this by thinking, ‘How can I achieve knowledge of the path that leads to cessation as related to knowledge of equilibrium, and then teach it to beings correctly?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་ཀུན་ནས་མཛེས་པ་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ། ཤིན་ཏུ་གནས་པའི་བར་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a patron-king named Magnificent, who reigned over numerous regions under the single umbrella of his command.

source: དེ་འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། བླ་ན་
en: He had created roots of virtue with countless thus-gone ones in the past.

source: མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ་དེ་འབའ་ཞིག་ཁོ་ནས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་ལ་དབང་ཕྱུག་གིས་དབང་བྱེད་པ་དང་ལྡན་པ་སྐྱོན་ཐམས་ཅད་དང་བྲལ་ཞིང་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་ནོ། །
en: He abided by the vehicle of unsurpassed and perfect buddhahood, and ruled as lord over the entire world of four continents by himself. He was free of all flaws and possessed all qualities.

source: དེ་ནས་རྒྱལ་པོ་ཀུན་ནས་མཛེས་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Once, King Magnificent thought to himself,

source: སྔོན་གྱི་འཁོར་ལོས་སྒྱུར་བ་རྣམས་ཀྱི་སྒྲུབ་པ་ཅི་འདྲ་བ་ཞིག་ཏུ་གྱུར།
en: ‘What were the achievements of the previous universal monarchs exactly?

source: བདག་སྒྲུབ་པ་གང་གིས་རྒྱལ་སྲིད་བྱ།
en: By what achievements am I ruling the kingdom?

source: བདག་འཁོར་ལོས་སྒྱུར་བའི་སྒྲུབ་པའི་ཆོས་སྤྱོད་པས་མི་འདའ་བར་བྱ།
en: I should not go against the Dharma practice carried out by the universal monarchs.

source: བདག་ཆོས་སྤྱད་པས་སྡིག་པའི་འགྲོ་བར་འགྱུར་བ་ནས་བདག་དབང་ཕྱུག་དང་ལྡན་པ་ལས་ངན་སོང་གི་སར་འཇུག་པའི་བར་དུ་མི་འགྲོ་བ་དག་རྒྱལ་པོའི་མིང་དོན་མེད་པར་མི་འགྱུར་བར་བྱ་སྙམ་ནསསྐྱོན་དེ་དག་ཡང་དག་པར་མཐོང་སྟེ།
en: By practicing the Dharma, I must avoid falling into evil and going from being in command to the lower states. I must not let my status as king become meaningless.’

source: བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: Recognizing these problems, he addressed his ministers:

source: འདི་ལྟར་གྲོང་གི་གཙོ་བོ་ཁྱེད་ཅག་ངའི་བྲན་ཡིན་ཏེ།
en: ‘You town leaders are all my servants.

source: རྒྱལ་སྲིད་སོ་སོར་སྲུང་བ་ཆོས་ཀྱི་རྒྱུད་སྟོན་པ་ཁྱེད་ལ་སྔོན་གྱི་རྒྱལ་པོས་བསྒྲུབས་པ་གང་གིས་རྒྱལ་སྲིད་རྗེས་སུ་བསྟན་པ་དང་། ཡོངས་སུ་སྦྱངས་པ་དང་སོ་སོར་བསྲུངས་པ་ང་འདྲི་ཡིས་ཇི་ལྟར་བདག་རྒྱལ་པོའི་སྒྲུབ་པ་རྒྱལ་སྲིད་མི་ཟད་པ་དང་། མི་ཉམས་པ་དང་། མི་འདའ་བ་དང་། རྗེས་སུ་སྟོན་པ་དེ་ཁྱོད་ཀྱིས་བདག་ལ་སྟོན་ཅིག་དེ་དག་གིས་འདི་སྐད་སྨྲས་སོ། །
en: As rulers of your own domains and teachers of the Dharma lineage I ask you, by what achievements did past kings demonstrate, develop, and maintain their kingdom? How can I succeed as a king so that my kingdom does not come to an end, does not decline, and does not pass away? Please advise me on this matter.’

source: ལྷ་བདག་ཅག་གིས་དེའི་དོན་མ་འཚལ་ཏོ། །
en: “The ministers replied, ‘Your Highness, we do not know the answer to this.

source: ལྷའི་ཉེན་ཀོར་ན་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་བྱུང་བ། ཆོས་ལ་མཁས་པ། བསྟན་བཅོས་ལ་མཁས་པ་རབ་ཏུ་དགའ་བའི་མིག་ཅན་ཞིག་མཆིས་ཏེ།
en: In your vicinity, Your Highness, there are sages who have superpowers, have renounced the life of a householder, are experts in the Dharma and in the treatises, and have pleasing gazes.

source: དེ་བསྒྲུབས་པ་གང་གིས་སྔོན་གྱི་རྒྱལ་པོའི་རྒྱལ་སྲིད་རྗེས་སུ་བསྟན་པ་དང་། ཡོངས་སུ་སྦྱངས་པ་དང་སོ་སོར་བསྲུངས་པ་འཚལ་ཏེ།
en: They will know the achievements by which the past generations of kings demonstrated, developed, and maintained their rule.

source: ལྷ་དེ་དག་བསྡུར་གསོལ་བསྡུས་ནས་འཁོར་ལོས་སྒྱུར་བའི་སྒྲུབ་པ་སྔོན་གྱི་རབས་ཡོངས་སུ་སྨྲར་གསོལ།
en: Request them to gather here and then ask them to describe the ancient legends of the universal monarchs.

source: འོན་ཏང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱུད་སྔོན་གྱི་རབས་འབྱུང་བར་འགྱུར་ལགས་སོ། །
en: The lives of past monarchs are told in the ancient legends.’

source: དེ་ནས་རྒྱལ་པོ་ཀུན་ནས་མཛེས་པ་བློན་པོ་དེ་དག་གི་ལྟར་མཉན་ནས་གང་འདི་དང་ཉེ་བ་ན་སྔོན་གྱི་མི་ཡུལ་གྱི་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་བྱུང་བ་དེ་དག་བཀུར་སྟི་ཆེན་པོས་རྒྱལ་པོའི་ཕོ་བྲང་རྒྱ་མཚོ་ཅན་དུ་སྡུད་པར་བྱེད་དོ། །
en: “King Magnificent listened attentively to the ministers, and then respectfully summoned to his Oceanic Palace those in the area who had renounced their previous lives as householders in the human world.

source: རྒྱལ་པོའི་ཕོ་བྲང་རྒྱ་མཚོ་ཅན་དེ་ཡང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། དགེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་ཞིང་། དེར་དེའི་སྐྱེ་བོ་དག་ཀུན་ཏུ་འདུས་པར་གྱུར་ཏོ། །
en: All of the people of the Oceanic Palace—with its wealth, prosperity, virtues, and good harvests, teeming with people and beings—then gathered there.

source: དེའི་ཚེ་རྒྱལ་པོ་ཀུན་ནས་མཛེས་པ་དེའི་དྲུང་དུ་དྲང་སྲོང་ཁྲི་ཕྲག་བརྒྱད་ཅུ་ཕལ་ཆེར་ལྔ་མངོན་པར་ཤེས་ཤིང་དགེ་བའི་རྩ་བ་ཡུན་རིང་དུ་སྤྱད་པ། སྐྱེ་དགུ་ལ་ཕན་པར་འདོད་པ་དག་ཅིག་བྱུང་ངོ་། །
en: At that point eight hundred thousand sages—most of whom possessed the five superpowers, had gathered the roots of virtue for a long time, and wished to help beings—appeared in the presence of King Magnificent.

source: རྒྱལ་པོ་ཀུན་ནས་མཛེས་པ་དེ་སྲོག་ཆགས་ཁྲི་རྣམས་དང་ལྷན་ཅིག་དཔུང་གི་ཚོགས་དང་། གྲོང་རྡལ་གྱི་ཡུལ་མི་དང་ལྷན་ཅིག་ཏུ་གུས་པ་ཆེན་པོས་དེ་དག་དཔག་ཚད་དུ་བསུའོ། །
en: Along with ten thousand beings, his army, and all the villagers, King Magnificent reverently welcomed them for the distance of a league.

source: གང་རྒྱལ་པོ་དེའི་ཡོངས་སུ་སྤྱོད་པའི་བཙུན་མོ་དང་། འཁོར་གྱི་སླས་བུད་མེད་ཁྲི་ཕྲག་བརྒྱད་ཅུ་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་དྲང་སྲོང་དེ་དག་ལ་སྟོན་པའི་འདུ་ཤེས་བསྐྱེད་ནསདྲང་སྲོང་དེ་དག་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Together with the queens who were in the king’s retinue, as well as eight hundred thousand handmaidens, they went before the sages, regarding them as teachers.

source: དྲང་སྲོང་དེ་དག་གི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། དྲང་སྲོང་དེ་དག་དང་ཡང་དག་པར་སྨྲ་བ་ལ་ཞུགས་སོ། །
en: They bowed their heads at the sages’ feet and stayed there to converse with them.

source: དེའི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་བསྒྲུབ་པའི་དོན་དུ་སྔོན་གྱི་རབས་འདོན་པའི་མི་སྲོག་ཆགས་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཙམ་འདུས་སོ། །
en: At that point, about eighty thousand people who recited the ancient legends gathered for the sake of the accomplishment of the universal monarch.

source: དེ་དག་ཐམས་ཅད་ལ་རྒྱལ་པོ་ཀུན་ནས་མཛེས་པ་དེ་ཞེས་ཆེན་པོར་བྱེད་དོ། །
en: King Magnificent treated them all with great respect.

source: དྲང་སྲོང་དེ་དག་དང་སྔོན་གྱི་རབས་འདོན་པའི་མི་དེ་དག་འཁོར་ལོས་སྒྱུར་བ་དེའི་སྒྲུབ་པའི་སྔོན་གྱི་རབས་ཀྱི་ངོ་བོ་དེ་དག་སྨྲ་བར་བྱེད་དེ།
en: The sages and men who recited ancient legends explained the essence of the past accomplishments of the universal monarchs.

source: འཁོར་ལོས་སྒྱུར་བའི་སྒྲུབ་པའི་སྔོན་གྱི་རབས་གང་གིས་རྒྱལ་སྲིད་བྱས་པ་དང་། རྗེས་སུ་བསྐྱངས་པ་དང་། རྗེས་སུ་བསྟན་པ་སྨྲས་སོ། །
en: They explained the ancient legends of how accomplished universal monarchs ruled and maintained their kingdom, and what proclamations they made.

source: དེ་དྲང་སྲོང་དེ་དག་དང་སྔོན་གྱི་རབས་འདོན་པ་དེ་དག་གི་ལྟར་མཉན་ནས་འཁོར་ལོས་སྒྱུར་བའི་སྒྲུབ་པ་འཕགས་པས་རྒྱལ་སྲིད་བྱེད་དོ། །
en: The noble accomplished monarch listened carefully to the sages and reciters of ancient legends, and proceeded to rule the kingdom accordingly.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་བྱམས་པའི་སེམས་ཉེ་བར་བཞག་སྟེ།
en: He applied a loving attitude toward all beings.

source: དེས་དེ་དག་རྒྱལ་སྲིད་ཀྱི་ཆོས་ཀྱི་རྗེས་སུ་བསྟན་ཅིང་ཚངས་པའི་གནས་བཞི་བསྐྱེད་དོ། །
en: He proclaimed the Dharma of the kingdom and engendered the four abodes of Brahmā.

source: སྐྱེ་བོ་ཐམས་ཅད་ལ་ཡང་ཚངས་པའི་གནས་བཞི་བསྐྱེད་དུ་བཙུད་དེ་དེ་དག་ཐམས་ཅད་ཀྱང་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་ཏེ། དེ་ན་སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤིན་ཏུ་བསྒོམས་ཏེ།
en: He also led all beings to engender the four abodes of Brahmā and all of them were reborn in the realm of Brahmā where they cultivated the path leading to cessation as related to knowledge of equilibrium.

source: ཚངས་པའི་འཇིག་རྟེན་དེ་ནས་ཤི་ནས། ཀུན་ནས་མཛེས་པ་དེ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་སྐྱེ་བོ་དག་དགེ་བའི་རྩ་བ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ནས་མཛེས་པ་དེ་ནི་མ་གཏོགས་སོ། །
en: Due to their roots of virtue, when they died in the realm of Brahmā, King Magnificent and all the other beings fully awakened to unsurpassed and perfect buddhahood and benefitted countless beings before they all passed into parinirvāṇa—all except for the bodhisattva King Magnificent.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། རྒྱལ་པོ་ཀུན་ནས་མཛེས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “What do you think, Maudgalyāyana? In case you may think that at that time King Magnificent was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་ཀུན་ནས་མཛེས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Magnificent.

source: དེའི་ཚེ་ཡང་ངས་ཆོས་ཀྱི་རྒྱལ་སྲིད་བྱས་ཤིང་ཚངས་པའི་འཇིག་རྟེན་བསྐྱེད།
en: In that age I ruled a spiritual kingdom and was born in the realm of Brahmā.

source: ད་ལྟར་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སྙོམས་པར་འཇུག་པ་འགོག་པར་འགྱུར་བའི་ལམ་རབ་ཏུ་བསྟན་ཏེ།
en: Now that I have fully awakened to unsurpassed and perfect buddhahood, I continue to teach the path that leads to cessation as related to the knowledge of equilibrium.

source: སྐྱེ་བོའི་ཚོགས་མང་པོ་དག་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླས་སོ། །
en: I have brought multitudes of beings to pass beyond suffering within the field of nirvāṇa free from any remainder of the aggregates.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དང་། སེམས་ཅན་རྣམས་ལ་སྟོན་པར་འདོད་པས་ཡོངས་སུ་འདྲི་བའི་རང་བཞིན་ཅན་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, those bodhisattvas who want to fully awaken to unsurpassed and perfect buddhahood and teach beings should cultivate inquisitiveness.”

source: མཽད་གལ་གྱི་བུ་ངས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་མངོན་པར་རྫོགས་པར་ཤེས་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created innumerable different roots of virtue in order to understand affliction. I did this by thinking, ‘How can I come to fully understand affliction and then teach it to sentient beings?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་དབང་པོ་བསྡམས་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Restrained Faculties.

source: འདོད་ཆགས་དང་མ་བྲལ་བ། སོ་སོར་བརྟགས་པ་དེས་དབང་པོ་འཛིན་པ་ཞིག་བྱུང་སྟེ། བསྒོམས་པའི་སྟོབས་ཀྱིས་ནི་མ་ཡིན་ནོ། །
en: He was not free from desire, but had taken hold of the faculties via discernment, not through meditation.

source: དེ་བདག་གི་དབང་པོ་ཡུལ་རྣམས་ལ་ཀུན་ནས་ཉོན་མི་མོངས་པར་བྱ་བའི་ཕྱིར་དགོན་པ་ནས་དགོན་པ་ཉིད་དུ་ཚལ་ནས་ཚལ་ཏུ་ནགས་ནས་ནགས་སུ་འགྲོའོ། །
en: So that his faculties would not be afflicted with respect to their objects, he wandered from one remote place to another, from grove to grove, and from forest to forest.

source: དེ་ཡུན་རིང་ཞིག་འདས་ནས་རེ་ཤིག་ཅིག་ན་བུད་མེད་ཅིག་མཐོང་བར་གྱུར་ཏོ། །
en: After a while he happened to see a woman.

source: དེའི་དབང་པོ་དེ་དག་སྡོམ་པས་གནས་ཤིང་མ་བསྒོམས་པས་བུད་མེད་དེ་མཐོང་མ་ཐག་ཏུ་འདོད་པའི་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་ཏོ། །
en: Since he had been trying to restrain his faculties but without meditating, as soon as he saw the woman, he was beset with passionate desire.

source: དེའི་འདོད་པའི་འདོད་ཆགས་སྐྱེས་པ་དེའི་ཚེ་དྲན་པ་རྙེད་དེ་དེ་འདི་སྙམ་དུ་སེམས་སོ། །
en: As that passionate desire welled up within him, he caught himself, and then thought,

source: སོ་སོར་རྟོག་པ་འདིས་བདག་གི་དབང་པོ་བཟུང་གི །ཤེས་པས་སོ་སོར་བརྟགས་པས་ནི་མ་ཡིན་ནོ་སྙམ་མོ། །
en: ‘While I am restraining my senses by means of analysis, it is not happening via discernment born of understanding.’

source: ཤེས་པ་གང་གིས་དབང་པོ་སོ་སོར་བསྲུངས་ཏེ། ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་བའི་འཕགས་པའི་ཡེ་ཤེས་བཙལ་བར་བྱའོ་སྙམ་མོ། །
en: ‘I should seek the unafflicted wisdom of the noble ones, the understanding by which I can restrain my senses.’

source: དེ་དེའི་ཚེ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ན་བར་དེར་བདག་ཉིད་ཀྱི་ཤེས་པ་སྐྱེས་ཏེ།
en: While he was then reflecting in this way, he had the following personal insight:

source: འདི་ལྟར་སྐྱེས་པའི་ཆོས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པར་བྱ་བ་དེ་དག་གང་ཡིན།
en: ‘The afflictive phenomena that arise in this way must be understood.

source: གང་ལ་བུད་མེད་ཀྱི་ཆོས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པར་བྱ་བ་དེ་དག་གང་ཡིན།
en: The afflictions that arise toward women must be understood.

source: དེ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ན་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་དེ་མི་དམིགས་ཤིང་། གང་ལ་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་དེ་ཡང་མི་དམིགས་སོ། །
en: By this type of analysis one does not apprehend afflictive phenomena, nor does one apprehend the phenomena toward which one is afflicted.’

source: དེ་དེའི་ཚེ་འདོད་པ་རྣམས་ལ་འདོད་ཆགས་དང་བྲལ་བ་རྗེས་སུ་ཐོབ་བོ། །
en: At that moment he achieved freedom from attachment to the objects of desire.

source: དེས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་འདི་ལ་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་གང་ཡང་མེད་ཅིང་། འདིར་གང་ལ་ཡང་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་གང་ཡང་མེད་པར་འཕགས་པའི་ཡེ་ཤེས་འདིས་ཐེ་ཙོམ་མེད་པ་རྗེས་སུ་ཐོབ་བོ། །
en: As he understood affliction, there were no afflictive phenomena, nor any phenomena toward which to be afflicted; by that wisdom of the noble ones he became free of doubt.

source: དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་དབང་པོ་བསྡམས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the sage named Restrained Faculties was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་དབང་པོ་བསྡམས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because in those days I was the sage named Restrained Faculties.

source: ཀུན་ནས་ཉོན་མོངས་པ་ཡོངས་སུ་ཤེས་པ་དེས། ང་ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་དམིགས་པ་རྣམས་ལ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དོ། །
en: By thus understanding affliction, I now have no afflictions with regard to afflictive apprehensions.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འཕགས་པའི་ཡེ་ཤེས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡོངས་སུ་ཤེས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should understand affliction through the wisdom of the noble ones.

source: མཽད་གལ་གྱི་བུ་ངས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ། སེམས་ཅན་རྣམས་གང་གིས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཐོབ་པར་འགྱུར་སྙམ་ནས། དགེ་བའི་རྩ་བ་རྒྱ་ཆེ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundlessly numerous and vast roots of virtue in order to understand the origin as related to knowledge of affliction. I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood and then teach beings about understanding the origin as related to knowledge of affliction? How can beings achieve such knowledge of the origin as related to knowledge of affliction?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་མི་ཤེས་པ་སྟོན་པ་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone one named Teacher of Ignorance;

source: རྒྱ་ཆེར་སྦྱར་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་འཁོར་བརྒྱ་ཕྲག་སྟོང་དུ་མ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་བ་དེར་འདི་ལྟ་སྟེ། ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལས་བརྩམས་ནས་ཆོས་སྟོན་ཏོ། །
en: Surrounded and honored by his retinue of hundreds of thousands, he gave a Dharma teaching about knowledge of the origin as related to knowledge of affliction.
